app/controllers/visitor_controller.rb

  def do_login

    name = params[:name]
    pswd = params[:password]

    unless name.blank? || pswd.blank?
      user = User.find_by_name(name).try(:authenticate, name, pswd)
---
SELECT `users`.* FROM `users` WHERE (name = 'seldon' and password_digest = 'd8578edf8458ce06fbc5bb76a58c5ca4')